# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [71]:
import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [72]:
a = pd.Series([100,200,300,400],index=['a','b','c','d'])

Print a, and data type

In [73]:
print(a,type(a))

a    100
b    200
c    300
d    400
dtype: int64 <class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [74]:
a[2]

300

What are the values of index for series a?

In [75]:
print(a.index)

Index(['a', 'b', 'c', 'd'], dtype='object')

Change the index to  ['c', 'a', 'b', 'd']

In [76]:
a =a.reindex(index =['c','a','b','d'])

In [77]:
a

c    300
a    100
b    200
d    400
dtype: int64

Access the value in the series with index 'd'

In [78]:
a['d']

400

Sort the values wrt to the index and print it

In [79]:
a = a.sort_index()
a

a    100
b    200
c    300
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [80]:
b = pd.Series([800,450,100],index=['e','f','g'])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [81]:
a = pd.concat([a,b])

In [82]:
#print a again after appending b into it

print(a)

a    100
b    200
c    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [83]:
a = a.sort_values()
a.index

Index(['a', 'g', 'b', 'c', 'd', 'f', 'e'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [84]:
df =pd.DataFrame(a)

In [85]:
print(df)

     0
a  100
g  100
b  200
c  300
d  400
f  450
e  800

What is the shape of the datafarme <br>
(also, what does it imply?)

In [86]:
df.shape
#this shows that our data frame df has 7 rows and 1 column

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [87]:
# yep its same as the series.

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [88]:

print(df.head()) #shows the initial 5 rows of our dataframe
print(df.tail()) #shows the last 5 rows of our dataset

     0
a  100
g  100
b  200
c  300
d  400
     0
b  200
c  300
d  400
f  450
e  800

Rename the column of the dataframe as 'points'

In [89]:
df.columns=['points']
df

   points
a     100
g     100
b     200
c     300
d     400
f     450
e     800

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [111]:
#Create fruits array

fruits_array = ['orange','mango','apple']

In [112]:
#Create series fruits out of fruits array
import random
fruits = pd.Series(random.choices(fruits_array,k=7),index=[0,1,2,3,4,5,6])
fruits

0     mango
1     mango
2     mango
3     apple
4     apple
5    orange
6     mango
dtype: object

Change the index of fruits to the index of dataframe df

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [113]:
df['fruits'] = fruits

In [114]:
df.head()

   points fruits
a     100    NaN
g     100    NaN
b     200    NaN
c     300    NaN
d     400    NaN

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [116]:
d1 = pd.DataFrame({'city':['Chandigarh','Delhi','Kanpur','Chennai','Manali'],'Temperature':[15,22,20,26,-2]})

print(d1)

In [117]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [118]:

d1.shape

(5, 2)

Set city = d1['city']

In [119]:

city = d1['city']

print city <br>
What is the type of city.

In [120]:

print(city)
print(type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object
<class 'pandas.core.series.Series'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [122]:
d2 = pd.DataFrame({'city':['Bengalaru','Coimbatore','Srirangam','Pondicherry'],'Temperature':[24,35,36,39]})
d2

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [123]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [139]:
d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

In [140]:
d2

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

In [144]:
d3 = pd.concat([d1,d2])

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [149]:
d3[d3['Temperature']<=20]

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [148]:
d3[d3['Temperature']<=35]

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2
0   Bengalaru           24
1  Coimbatore           35

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not.
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [152]:
d3['city'].values

array(['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali', 'Bengalaru',
       'Coimbatore', 'Srirangam', 'Pondicherry'], dtype=object)

In [155]:
# write function here
ut=[]
cities = d3['city'].values

def is_ut(cities):
    for city in cities:
        if city in ['Chandigarh','Pondicherry','Delhi']:
            ut.append(True)
        else:
            ut.append(False)
is_ut(cities)
ut

d3['is_ut'] = ut

In [156]:
d3

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengalaru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT -
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [159]:
# write function here

def c_to_f(temperature_in_celsius):
    return (1.8*temperature_in_celsius+32)

In [161]:
# check function c_to_f(10)
c_to_f(10)

50.0

In [162]:
d3['Temperature'].values

array([15, 22, 20, 26, -2, 24, 35, 36, 39], dtype=int64)

In [166]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

d3['Tempearture_in_Fahrenheit']= d3['Temperature'].apply(c_to_f)
d3

          city  Temperature  is_ut  Tempearture_in_Fahrenheit
0   Chandigarh           15   True                       59.0
1        Delhi           22   True                       71.6
2       Kanpur           20  False                       68.0
3      Chennai           26  False                       78.8
4       Manali           -2  False                       28.4
0    Bengalaru           24  False                       75.2
1   Coimbatore           35  False                       95.0
2    Srirangam           36  False                       96.8
3  Pondicherry           39   True                      102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [167]:
d3[d3['is_ut']==True]

          city  Temperature  is_ut  Tempearture_in_Fahrenheit
0   Chandigarh           15   True                       59.0
1        Delhi           22   True                       71.6
3  Pondicherry           39   True                      102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [168]:
d3[d3['Tempearture_in_Fahrenheit']>90]

          city  Temperature  is_ut  Tempearture_in_Fahrenheit
1   Coimbatore           35  False                       95.0
2    Srirangam           36  False                       96.8
3  Pondicherry           39   True                      102.2

Select only the first three rows of the dataframe d1.

In [169]:
d1.head(3)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20

Select all the rows and last two columns in the dataframe.

In [177]:
d3.iloc[:,-2:]

   is_ut  Tempearture_in_Fahrenheit
0   True                       59.0
1   True                       71.6
2  False                       68.0
3  False                       78.8
4  False                       28.4
0  False                       75.2
1  False                       95.0
2  False                       96.8
3   True                      102.2

## Groupby

In [182]:
# Create a dataframe using dictionary of your choice

data ={
    'Name':['Shalini','Prasad','Avika','Dhruv','Vinita','Jayprakash','Sourabh'],
    'Age':[7,7,8,7,8,8,7],
    'Marks':[45,46,46,43,42,42,47]
}

df = pd.DataFrame(data)
df

         Name  Age  Marks
0     Shalini    7     45
1      Prasad    7     46
2       Avika    8     46
3       Dhruv    7     43
4      Vinita    8     42
5  Jayprakash    8     42
6     Sourabh    7     47

In [200]:
# Use Groupby of single column with aggregate sum()

df.groupby('Age')['Name'].sum()

Age
7    ShaliniPrasadDhruvSourabh
8        AvikaVinitaJayprakash
Name: Name, dtype: object

In [199]:
# Use Groupby of single column with aggregate count()

df.groupby('Marks')['Name'].count()

Marks
42    2
43    1
45    1
46    2
47    1
Name: Name, dtype: int64

In [202]:

# Use Groupby of single column with aggregate min() and max()

df.groupby('Marks')['Name'].min()

Marks
42    Jayprakash
43         Dhruv
45       Shalini
46         Avika
47       Sourabh
Name: Name, dtype: object

In [203]:
df.groupby('Marks')['Name'].max()

Marks
42     Vinita
43      Dhruv
45    Shalini
46     Prasad
47    Sourabh
Name: Name, dtype: object

In [211]:
# Use Groupby of any 2 columns with aggregate mean()

df.groupby('Name').mean()

            Age  Marks
Name
Avika       8.0   46.0
Dhruv       7.0   43.0
Jayprakash  8.0   42.0
Prasad      7.0   46.0
Shalini     7.0   45.0
Sourabh     7.0   47.0
Vinita      8.0   42.0

In [214]:
# Use Groupby of any 2 columns with aggregate min() and max()

df.groupby('Name').agg({'Marks': ['min', 'max'], 'Age': ['min', 'max']})

           Marks     Age
             min max min max
Name
Avika         46  46   8   8
Dhruv         43  43   7   7
Jayprakash    42  42   8   8
Prasad        46  46   7   7
Shalini       45  45   7   7
Sourabh       47  47   7   7
Vinita        42  42   8   8